:PROPERTIES:
:ID: 3EBF5F97-6090-4329-BBEC-E5BFD2FA2026
:END:
#+title: Delete All ORES Databases
#+description: Delete All ORES Databases
#+type: recipe
#+level: cross
#+filetags: :recipe:sql:database_management:
#+created: 2026-05-21
#+updated: 2026-05-21

*WARNING*: This deletes ALL ORES databases (instances, dev, test). Use
with caution!

#+begin_src sql
select format('DROP DATABASE IF EXISTS %I;', database_name)
from ores_utility_ores_databases_view \gexec
#+end_src

#+RESULTS:
#+begin_example
DROP DATABASE
#+end_example
